package com.example.tvsample.entity;

import java.util.List;

/**
 * Created by JasonWu on 2017/12/30
 */

public class VideoListInfo {

    /**
     * code : 200
     * data : [{"cover":"https://i.ytimg.com/vi/r_bobF8ZnHo/mqdefault.jpg","description":"侯武忠選擇故鄉澎湖作為他開始行醫的起點，因為他深切體認到，澎湖離島為台灣醫療體系最弱的一環。為建立病患對醫師的信心，他自我為求準時看診，自掏腰包，包下交通船定期到離島赴診","episode":5,"id":"5f1c26537e037ced5fe9c12cd18dbf33","tags":["mainland"],"title":"菊島醫師情"},{"cover":"https://i.ytimg.com/vi/O7PEow9NXXM/mqdefault.jpg","description":"韓瑜、李政穎主演的最新鄉土劇🔥\n竹南中港路上的合利米店，長男王振源娶到了人稱「崎頂美人」的陳阿珠，郎才女貌幸福姻緣，羨煞街坊鄰居，傳為地方佳話\u2026 ","episode":16,"id":"b970561ae09f5a4b709d8c534b931d8b","tags":["mainland"],"title":"竹南往事"},{"cover":"http://i.ytimg.com/vi/vuTiRjVxtgA/mqdefault.jpg","description":"由王迎執導，任重，張萌，曾泳醍，賈景暉，王倩一，張嘉譯等出演。該劇講述了都市青年男女既浪漫又充滿現實殘酷的創業以及戀愛的故事(百度百科)","episode":30,"id":"b016826b640a7be4b62e4f07c0578796","tags":["mainland"],"title":"敢愛"},{"cover":"http://i.ytimg.com/vi/4A2utxgo7qs/mqdefault.jpg","description":"由劉愷執導，李晨，張歆藝，陳赫，張萌，田雷，李倩等領銜主演。該劇講述三個男人在合租房意外收穫了一個從天而降的嬰兒，由此引發一系列不靠譜的事件後，決定為孩子奮鬥成為三個奶爸的故事。(百度百科)","episode":34,"id":"dc4d0e64553038a0165f5cf3caa38844","tags":["mainland"],"title":"三個奶爸"},{"cover":"http://i.ytimg.com/vi/6L2XunvbQmg/mqdefault.jpg","description":"美國對大多數中國人來講是一個遙遠陌生的國度，來自大洋彼岸的消息也不相同，有人說那裡是天堂，有人說那裡是地獄。大提琴家王起明和妻子郭燕從肯尼迪機場下機伊始就陷入了一種可怕的幻滅感中，為了謀生，王起明進餐館打工，郭燕去工廠幹活。在嚴酷的現實面前，他們放棄了同甘共苦的初衷，走上了一條充滿競爭，心酸，冷漠的人生之路。（百度百科）","episode":21,"id":"08a3e087d67969680696fb6c655d067c","tags":["mainland"],"title":"北京人在紐約"},{"cover":"http://i.ytimg.com/vi/Yf_MHGQDFYw/mqdefault.jpg","description":"迪麗熱巴、馬可領銜主演，王洋、邵兵、寇振海、王煜、劉潺、王路、佟瑞、江明洋等聯合主演。該劇講述了關小迪、梁大巍以及他們的小伙伴們經歷了殘酷訓練之後一步步成長為新世紀保鏢的熱血故事（百度百科）","episode":37,"id":"ce1ebbe9e57dfbe87ef0a1af84da9da5","tags":["mainland"],"title":"麻辣變形記"},{"cover":"http://i.ytimg.com/vi/fT4YHy1bcFY/mqdefault.jpg","description":"王連平執導的都市情感劇，由韓棟、江鎧同、李威、張熙媛、王偉、梁愛琪等主演。該劇以都市生活為背景，講述了段天朗、穆清岺等性格不同的年輕人的愛情故事（百度百科）","episode":60,"id":"97dcdb3edaab114e098a14b1ed0a92d7","tags":["mainland"],"title":"愛來的剛好"},{"cover":"http://i.ytimg.com/vi/XQK036VpLKI/mqdefault.jpg","description":"由秦海璐、郭曉東、江祖平、胡兵領銜主演。該劇以骨肉情深、情感糾葛和事業之爭為線索，講述了時尚辣媽遭遇事業與愛情的雙重危機，永不言敗的勵志故事(百度百科)","episode":48,"id":"aa03cd4e08a85c692c0f95fa9687256b","tags":["mainland"],"title":"媽媽向前衝衝衝"},{"cover":"http://i.ytimg.com/vi/U1PUFrLwWfA/mqdefault.jpg","description":"該劇由何靜擔任總製片人總發行人，吳玉江擔任製片人，袁曉滿執導，拉布拉多犬小七、加菲貓阿旺、張雲龍、王洋、王煜領銜主演。該劇講述了高冷帥氣的海上救生員鮑宇和花痴萌妹歐葉，在神犬小七的幫助下終成眷屬，並一起保護國家文物、打擊海上盜寶惡勢力的故事。（百度百科）","episode":42,"id":"987d9d3303d8f62c28029b3bb6e87f55","tags":["mainland"],"title":"神犬小七第二季"},{"cover":"http://i.ytimg.com/vi/LSl4hPhGH3c/mqdefault.jpg","description":"該劇由梁振華編劇，潘鏡丞執導，賈乃亮，穎兒，杜淳，劉燁，熊乃瑾等主演。該劇講述了一群80後的年輕人從美好青蔥校園步入職場奮鬥，經歷成長的洗禮與蛻變，共同譜寫了一段跌宕起伏的青春戀曲。（百度百科）","episode":44,"id":"f8f1632abfe4b4ac4395d617f139841a","tags":["mainland"],"title":"冰與火的青春"}]
     * msg : success
     */

    private String code;
    private String msg;
    private List<VideoListEntity> data;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public List<VideoListEntity> getData() {
        return data;
    }

    public void setData(List<VideoListEntity> data) {
        this.data = data;
    }
}
